{
  "projects": [
    {
      "repo": "https://github.com/mseneshen/GUBAbel",
      "image": "babel-fish.png",
      "title": "Babel Fish Captions",
      "text": "HackED 2021 3rd place winner. We were inspired by the pandemic and the fact that we all know have to sit through many online lectures or meetings. For some, this may be more difficult as they may be hearing impaired or may not be a native speaker of the other speaker's language. This application gives the end user a live captioning window with automatic transcription and translation of the desktop audio. Made with Micah Seneshen.",
      "tools": [
        "html",
        "css",
        "vue",
        "vuetify",
        "ffmpeg",
        "electron",
        "typescript",
        "google-cloud"
      ]
    },
    {
      "repo": "https://github.com/giancarlopernudisegura/adapting-behavior",
      "image": "adapting-behaviour.png",
      "title": "Adapting Behavior via Intrinsic Reward: A Survey and Empirical Study Experiment Implementation",
      "text": "Two notebooks implementing experiments 2 and 3 from a research paper. Made with Yahya Kisana.",
      "tools": [
        "python",
        "jupyter-notebook",
        "numpy",
        "matplotlib"
      ]
    },
    {
      "repo": "https://github.com/UndergraduateArtificialIntelligenceClub/skin_cancer",
      "image": "skincancer.png",
      "title": "Are you smarter than an AI?",
      "text": "Compare your accuracy in diagnosing skin cancer to a trained image classification model. This was made as a demo for our club (the Undergraduate Artificial Intelligence Society) for an AI in Medicine symposium. We took a pre-trained resnet50 model and fine-tuned it on a skin cancer dataset, then wrote the web app to allow users to compete against it. We used fast.ai as our deep learning library of choice, and Flask for the web app. Made in collaboration with Peter Friedrich and Will Fenton.",
      "tools": [
        "html",
        "css",
        "flask",
        "fast.ai",
        "google-cloud",
        "machine-learning",
        "javascript"
      ]
    },
    {
      "repo": "https://github.com/giancarlopernudisegura/driver-test-booker",
      "image": "alberta.png",
      "title": "Alberta Driver's Test Booker",
      "text": "Look for available driver tests in Alberta and text you if any tests are found.",
      "tools": [
        "puppeteer",
        "twilio",
        "javascript"
      ]
    },
    {
      "repo": "https://github.com/giancarlopernudisegura/today",
      "demo": "https://giancarlopernudisegura.github.io/today/",
      "image": "today.png",
      "title": "Today is",
      "text": "Shows all the current daily and monthly celebrations for the current date. Uses fetch-api and the MediaWiki API to query information from Wikipedia.",
      "tools": [
        "html",
        "css",
        "javascript"
      ]
    },
    {
      "repo": "https://github.com/wagonhelm/neuro-car/",
      "image": "yeetmind.png",
      "title": "YeetMind (MindOverDrive)",
      "text": "This project won 3rd place for best project overall at HackED 2020. It also won for best use of hardware. A Muse2 EEG device is used with Fourier transforms to produce a vector of frequencies and amplitudes. This vector is passed into three different SVM classifiers, which have been trained to detect eye state (closed vs open), level of fatigue, as well as if the user is currently focusing on the road. Our classifiers were trained on data collected throughout the night of HackED from willing participants, in an attempt to make our models more generalized. If the classifier determines the user's eyes to be closed, an electric shock is sent to a wirelessly controlled wristband. In addition, our wireless robot car pulls over and stops.<br>I worked on the front end of the web application, the domain routing, and the google-cloud backend for running the website.",
      "tools": [
        "html",
        "react",
        "python",
        "c++",
        "google-cloud",
        "machine-learning"
      ]
    },
    {
      "repo": "https://github.com/ualberta-spacebar/SolarSim",
      "demo": "https://ualberta-spacebar.github.io/SolarSim/",
      "image": "solarsim.png",
      "title": "SolarSim",
      "text": "This is a solar system web simulator. Users can create, edit, and delete planets. They can also, change the sun and see how it affects the planets. This was made for the 2019 NASA Space Apps. This was made in collaboration with Will Fenton, Jawad Rizvi, and Dylan Hanna. I worked on the planet physics engine, the front end design.",
      "tools": [
        "html",
        "html-canvas",
        "css",
        "sass",
        "javascript",
        "jquery"
      ]
    },
    {
      "demo": "https://uais.dev/",
      "repo": "https://github.com/UndergraduateArtificialIntelligenceClub/website",
      "image": "uais.svg",
      "title": "UAIS Website",
      "text": "This was made in middleman and hosted on aws. I have contributed on the majoriy of the front-end. The website uses the aws lambda functions to process form submissions.",
      "tools": [
        "middleman",
        "haml",
        "sass",
        "ruby",
        "aws-s3",
        "aws-dynamodb"
      ]
    },
    {
      "repo": "https://github.com/willfenton/Identicon",
      "image": "identicon.png",
      "title": "Identicon Generator",
      "text": "This Identicon generator uses and pseudo-random hash to to generate images. It takes a hash to plot points on an image, then uses nearest neighbors algorithm on each pixel to give it a random color. The thumbnail for this project was made with the string \"identicon\". This was made in collaboration with Will Fenton.",
      "tools": [
        "python",
        "pillow"
      ]
    },
    {
      "demo": "https://giancarlopernudisegura.github.io/ww1-cafmap/",
      "repo": "https://github.com/giancarlopernudisegura/ww1-cafmap",
      "image": "ww1-cafmap.png",
      "title": "WW1 CAF Casualties Map",
      "text": "This project was made for a data visualization workshop hosted by darkhorse analytics. This is an interactive map that shows the number of deaths per month of WW1 for all the Canadian Army soldiers on each country. This was made in collaboration with Will Fenton. We used a dataset that contained a list of soldiers, their date of death, and burial location, transformed it to a geojson file, and then plotted it on a map. Users can scroll for every month and see the biggest battles for each month.",
      "tools": [
        "html",
        "html-canvas",
        "css",
        "javascript",
        "d3",
        "python",
        "geojson",
        "mapbox"
      ]
    },
    {
      "repo": "https://github.com/giancarlopernudisegura/recorded-shell",
      "image": "rs.png",
      "title": "Recorded Shell",
      "text": "This tool runs a script file as if you were typing the commands on the spot.",
      "tools": [
        "c"
      ]
    },
    {
      "repo": "https://github.com/giancarlopernudisegura/packingList",
      "image": "packingList.png",
      "title": "Packing List",
      "text": "This was a short project. I often need to pack for trips but never know if I've packed everything. The user simply inputs some information about their trip and the program outputs a markdown file. This can be either saved directly to an output file, or it can be piped to another program like pandoc to be converted into another filetype.",
      "tools": [
        "python"
      ]
    }
  ]
}
